OpenNuvoton/NUC505BSP/SampleCode/StdDriver/SD_FATFS/main.c
    putchar('\n');
}


#ifdef _SD_USE_INT_
extern void SD_Close_(uint32_t cardSel);

void SD0_Handler(void)
{
    unsigned int volatile isr;
    unsigned int volatile ier;

    // FMI data abort interrupt
    if (SD->FMIISR & SD_FMIISR_DTA_IE_Msk)
    {
        /* ResetAllEngine() */
        SD->FMICR |= SD_FMICR_SW_RST_Msk;
        SD->FMIISR = SD_FMIISR_DTA_IE_Msk;
    }

    //----- SD interrupt status
    isr = SD->SDISR;
    if (isr & SD_SDISR_BLKD_IF_Msk)     // block down
    {
        extern uint8_t volatile _sd_SDDataReady;
        _sd_SDDataReady = TRUE;
        SD->SDISR = SD_SDISR_BLKD_IF_Msk;
    }

    if (isr & SD_SDISR_CD0_IF_Msk)   // port 0 card detect
    {
        //----- SD interrupt status
        // it is work to delay 50 times for SD_CLK = 200KHz
        {
            volatile int i;         // delay 30 fail, 50 OK
            for (i=0; i<500; i++);  // delay to make sure got updated value from REG_SDISR.
            isr = SD->SDISR;
        }

#ifdef _USE_DAT3_DETECT_
        if (!(isr & SD_SDISR_CDPS0_Msk))
        {
            SD0.IsCardInsert = FALSE;
            SD_Close_(0);
        }
        else
        {
            disk_initialize(SD_Drv);
        }
#else
        if (isr & SD_SDISR_CDPS0_Msk)
        {
            SD0.IsCardInsert = FALSE;   // SDISR_CD_Card = 1 means card remove for GPIO mode
            SD_Close_(0);
        }
        else
        {
            disk_initialize(SD_Drv);
        }
#endif

        SD->SDISR = SD_SDISR_CD0_IF_Msk;
    }

    // CRC error interrupt
    if (isr & SD_SDISR_CRC_IF_Msk)
    {
        if (!(isr & SD_SDISR_CRC_16_Msk))
        {
            //printf("***** ISR sdioIntHandler(): CRC_16 error !\n");
            // handle CRC error
        }
        else if (!(isr & SD_SDISR_CRC_7_Msk))
        {
            extern uint32_t _sd_uR3_CMD;
            if (! _sd_uR3_CMD)
            {
                //printf("***** ISR sdioIntHandler(): CRC_7 error !\n");
                // handle CRC error
            }
        }
        SD->SDISR = SD_SDISR_CRC_IF_Msk;      // clear interrupt flag
    }
}


void SD_IRQHandler(void)
{
    if( ((SD->SDCR & SD_SDCR_SDPORT_Msk) >> (SD_SDCR_SDPORT_Pos)) == 0 )
    {
        SD0_Handler();
        // } else if( ((SD->SDCR & SD_SDCR_SDPORT_Msk) >> (SD_SDCR_SDPORT_Pos)) == 1 ) {
        // SD1_Handler();
    }
}
#endif


volatile uint32_t system_Tick = 0;
//---------------------------------------------------------
//--- ISR for Timer0 interrupt
//---------------------------------------------------------
void TMR0_IRQHandler(void)
{
    system_Tick++;

    // clear timer interrupt flag
    TIMER_ClearIntFlag(TIMER0);
}


//---------------------------------------------------------
//--- Initial UART0
//---------------------------------------------------------
void UART0_Init(void)
{
    //--- UART0 clock source = XIN
    CLK->CLKDIV3 &= ~(CLK_CLKDIV3_UART0DIV_Msk | CLK_CLKDIV3_UART0SEL_Msk);

    //--- Enable UART0 IP clock
    CLK_EnableModuleClock(UART0_MODULE);

    //--- Reset UART0 IP
    SYS->IPRST1 |=  SYS_IPRST1_UART0RST_Msk;
    SYS->IPRST1 &= ~SYS_IPRST1_UART0RST_Msk;

    //--- Set GPB0/1 multi-function pins for UART0 RXD and TXD
    SYS->GPB_MFPL = (SYS->GPB_MFPL & (~SYS_GPB_MFPL_PB0MFP_Msk) ) | SYS_GPB_MFPL_PB0MFP_UART0_TXD;
    SYS->GPB_MFPL = (SYS->GPB_MFPL & (~SYS_GPB_MFPL_PB1MFP_Msk) ) | SYS_GPB_MFPL_PB1MFP_UART0_RXD;

    //--- Configure UART0 attribution and set UART0 Baudrate
    UART0->LINE |=0x07;         // 8-bit, no parity, 1 stop bit
    UART0->BAUD = 0x30000066;   // 12MHz Crystal in, for 115200
}


//---------------------------------------------------------
//--- Initial UART1
//---------------------------------------------------------
void UART1_Init(void)
{
    //--- UART1 clock source = XIN
    CLK->CLKDIV3 &= ~(CLK_CLKDIV3_UART1DIV_Msk | CLK_CLKDIV3_UART1SEL_Msk);

    //--- Enable UART1 IP clock
    CLK_EnableModuleClock(UART1_MODULE);

    //--- Reset UART1 IP
    SYS->IPRST1 |=  SYS_IPRST1_UART1RST_Msk;
    SYS->IPRST1 &= ~SYS_IPRST1_UART1RST_Msk;

    //--- Set GPB6/7 multi-function pins for UART1 RXD and TXD
    SYS->GPB_MFPL = (SYS->GPB_MFPL & (~SYS_GPB_MFPL_PB6MFP_Msk) ) | SYS_GPB_MFPL_PB6MFP_UART1_TXD;
    SYS->GPB_MFPL = (SYS->GPB_MFPL & (~SYS_GPB_MFPL_PB7MFP_Msk) ) | SYS_GPB_MFPL_PB7MFP_UART1_RXD;

    //--- Configure UART1 attribution and set UART1 Baudrate
    UART1->LINE |=0x07;         // 8-bit, no parity, 1 stop bit
    UART1->BAUD = 0x30000066;   // 12MHz Crystal in, for 115200
}


//---------------------------------------------------------
//--- Initial UART2
//---------------------------------------------------------
void UART2_Init(void)
{
    //--- UART2 clock source = XIN
    CLK->CLKDIV3 &= ~(CLK_CLKDIV3_UART2DIV_Msk | CLK_CLKDIV3_UART2SEL_Msk);

    //--- Enable UART2 IP clock
    CLK_EnableModuleClock(UART2_MODULE);

    //--- Reset UART2 IP
    SYS->IPRST1 |=  SYS_IPRST1_UART2RST_Msk;
    SYS->IPRST1 &= ~SYS_IPRST1_UART2RST_Msk;

    //--- Set GPB10/11 multi-function pins for UART2 RXD and TXD
    SYS->GPB_MFPH = (SYS->GPB_MFPH & (~SYS_GPB_MFPH_PB10MFP_Msk) ) | SYS_GPB_MFPH_PB10MFP_UART2_TXD;
    SYS->GPB_MFPH = (SYS->GPB_MFPH & (~SYS_GPB_MFPH_PB11MFP_Msk) ) | SYS_GPB_MFPH_PB11MFP_UART2_RXD;

    //--- Configure UART2 and set UART2 Baudrate
    UART2->LINE |=0x07;         // 8-bit, no parity, 1 stop bit
    UART2->BAUD = 0x30000066;   // 12MHz Crystal in, for 115200
}


//---------------------------------------------------------
//--- Initial SD0 multi-function GPIO pin
//
// NUC505 support 3 groups of GPIO pins and SD sockets for same one SD port.
// Please select ONLY ONE configuration from them.
// 1. SD-A socket on daughter board + default SD0_Init(). (Default)
// 2. SD-B socket on main board + short JP3 and JP4
//    + define compile flag "SDH_GPIO_GB" in SD0_Init().
//    (Note: this configuration conflict with UART1)
// 3. SD-C socket on main board + short JP3 and JP2
//    + define compile flag "SDH_GPIO_GA" in SD0_Init()
//    (Note: this configuration conflict with UART0)
//---------------------------------------------------------
void SD0_Init(void)
{
#ifdef SDH_GPIO_GA
    // The group A are GPA10~11, GPA13~15, GPB0~1
    // Conflict with UART0
    // printf("SD_Open(): Configure GPIO group A as SDH pins.\n");
    SYS->GPA_MFPH &= (~0x77707700);
    SYS->GPA_MFPH |=   0x44404400;
    SYS->GPA_MFPH &= (~0x00000077);
    SYS->GPB_MFPL |=   0x00000044;

