OpenNuvoton/NUC505BSP/SampleCode/StdDriver/SD_FATFS/main.c
#elif defined SDH_GPIO_GB
    // The group B are GPB2~3, GPB5~9
    // Conflict with UART1
    // printf("SD_Open(): Configure GPIO group B as SDH pins.\n");
    SYS->GPB_MFPL &= (~0x77707700);
    SYS->GPB_MFPL |=   0x44404400;
    SYS->GPB_MFPH &= (~0x00000077);
    SYS->GPB_MFPH |=   0x00000044;

#elif defined SDH_GPIO_G_48PIN
    // The group 48PIN are GPB0~3, GPB5~7 for NUC505 48PIN chip
    // Conflict with both UART0 and UART1
    // printf("SD_Open(): Configure special GPIO as SDH pins for 48 pins NUC505 chip.\n");
    SYS->GPB_MFPL &= (~0x77707777);
    SYS->GPB_MFPL |=   0x44404444;

#else   // default for defined SDH_GPIO_GC
    // The group C are GPC0~2, GPC4~7
    // printf("SD_Open(): Configure GPIO group C as SDH pins.\n");
    SYS->GPC_MFPL &= (~0x77770777);
    SYS->GPC_MFPL |=   0x11110111;
#endif
}


//---------------------------------------------------------
//--- Initial system clock for NUC505
//---------------------------------------------------------
void SYS_Init(void)
{
    //--- Set system clock to PLL and set PLL to 96MHz
    CLK_SetCoreClock(96000000);   // don't support clock that > 100MHz
    SystemCoreClockUpdate();

    //--- set APB clock as half of HCLK
    CLK_SetModuleClock(PCLK_MODULE, 0, 1);

    //--- Initial UART
    //--- MUST also to modify DEBUG_PORT in retarget.c for the UART port that you wanted.
    UART0_Init();

    //--- Initial SD0 multi-function pin
    SD0_Init();
}


/*---------------------------------------------------------*/
/* User Provided RTC Function for FatFs module             */
/*---------------------------------------------------------*/
/* This is a real time clock service to be called from     */
/* FatFs module. Any valid time must be returned even if   */
/* the system does not support an RTC.                     */
/* This function is not required in read-only cfg.         */

unsigned long get_fattime (void)
{
    unsigned long tmr;

    tmr=0x00000;

    return tmr;
}

uint8_t Read_Buf[1024];
uint8_t Write_Buf[1024];


//-------------------------------------------------------------------------
// This demo program be able to access a SD card formatted in FAT file system.
//
// For NUC505 demo board NHS-NUC505-1-IN-1M11/NHS-NUC505-1-IN-1D11, please
// insert SD card to SD socket A (SD-A on daughter board) before execute program.
//-------------------------------------------------------------------------
int32_t main(void)
{
    char *ptr, *ptr2;
    long p1, p2, p3;
    BYTE *buf;
    FATFS *fs;              /* Pointer to file system object */
    FRESULT res;

    DIR dir;                /* Directory object */
    FIL file1, file2;       /* File objects */
    UINT s1, s2, cnt, buf_size;
    static const BYTE ft[] = {0, 12, 16, 32};
    DWORD ofs = 0, sect = 0;

    //----- Initial system
    SYS_Init();

    printf("\n\nInitial NUC505 System Clock\n");
    printf("   CPU clock %dMHz\n", CLK_GetCPUFreq()/1000000);
    printf("   PLL clock %dMHz\n", CLK_GetPLLClockFreq()/1000000);

    printf("\n\nNUC505 SD FATFS TEST!\n");

    printf("   For NUC505 demo board NHS-NUC505-1-IN-1M11/NHS-NUC505-1-IN-1D11,\n");
    printf("      please insert SD card to SD socket A (SD-A on daughter board)\n");
    printf("      before execute program.\n");

    //----- Initial Timer0 for system tick.
    //----- The ISR for Timer0 is TMR0_IRQHandler() that defined at startup_NUC505Series.s
    CLK_EnableModuleClock(TMR0_MODULE);                     // Enable IP clock
    CLK_SetModuleClock(TMR0_MODULE, CLK_TMR0_SRC_EXT, 0);   // Select IP clock source
    TIMER_Open(TIMER0, TIMER_PERIODIC_MODE, 100);   // Set timer frequency to 100HZ. 1 tick = 10ms
    TIMER_EnableInt(TIMER0);                        // Enable timer interrupt
    NVIC_EnableIRQ(TMR0_IRQn);                      // Enable External Interrupt in NVIC for Timer0
    TIMER_Start(TIMER0);                            // Start Timer0

    printf("rc=%d\n", (WORD)disk_initialize(SD_Drv));
    disk_read(SD_Drv, Buff, 2, 1);
    //f_mount(0, &FatFs[0]);  // for FATFS v0.09
    // Register work area to the default drive
    f_mount(&FatFs[0], "", 0);  // for FATFS v0.11

    for (;;)
    {
        printf(_T(">"));
#if defined ( __GNUC__ )    /* For Eclipse/GCC Compiler */
        /* The default I/O buffer mode is "Line Buffer" on Eclipse/GCC. */
        /* Flush data in buffer and print them out immediately.         */
        fflush(stdout);
#endif

        ptr = Line;
        get_line(ptr, sizeof(Line));
        switch (*ptr++)
        {

        case 'q' :  /* Exit program */
            while(1);
#if defined ( __GNUC__ )    /* For Eclipse/GCC Compiler */
            break;
#endif

        case 'd' :
            switch (*ptr++)
            {
            case 'd' :  /* dd [<lba>] - Dump sector */
                if (!xatoi(&ptr, &p2)) p2 = sect;
                res = (FRESULT)disk_read(SD_Drv, Buff, p2, 1);
                if (res)
                {
                    printf("rc=%d\n", (WORD)res);
                    break;
                }
                sect = p2 + 1;
                printf("Sector:%lu\n", p2);
                for (buf=(unsigned char*)Buff, ofs = 0; ofs < 0x200; buf+=16, ofs+=16)
                    put_dump(buf, ofs, 16);
                break;

            case 'i' :  /* di - Initialize disk */
                printf("rc=%d\n", (WORD)disk_initialize(SD_Drv));
                break;
            }
            break;

        case 'b' :
            switch (*ptr++)
            {
            case 'd' :  /* bd <addr> - Dump R/W buffer */
                if (!xatoi(&ptr, &p1)) break;
                for (ptr=(char*)&Buff[p1], ofs = p1, cnt = 32; cnt; cnt--, ptr+=16, ofs+=16)
                    put_dump((BYTE*)ptr, ofs, 16);
                break;

            case 'e' :  /* be <addr> [<data>] ... - Edit R/W buffer */
                if (!xatoi(&ptr, &p1)) break;
                if (xatoi(&ptr, &p2))
                {
                    do
                    {
                        Buff[p1++] = (BYTE)p2;
                    }
                    while (xatoi(&ptr, &p2));
                    break;
                }
                for (;;)
                {
                    printf("%04X %02X-", (WORD)p1, Buff[p1]);
                    get_line(Line, sizeof(Line));
                    ptr = Line;
                    if (*ptr == '.') break;
                    if (*ptr < ' ')
                    {
                        p1++;
                        continue;
                    }
                    if (xatoi(&ptr, &p2))
                        Buff[p1++] = (BYTE)p2;
                    else
                        printf("???\n");
                }
                break;

