OpenNuvoton/NUC505BSP/SampleCode/StdDriver/SD_FATFS/main.c
        case 'p' :      // for performance test
            switch (*ptr++)
            {
            case 'r' : /* pr <file_name> - get performance for file reading */
                while (*ptr == ' ') ptr++;
                printf("Opening \"%s\"", ptr);
                res = f_open(&file1, ptr, FA_OPEN_EXISTING | FA_READ);
                putchar('\n');
                if (res)
                {
                    put_rc(res);
                    break;
                }
                printf("Reading...\n");

                // test for 1KB buffer size
                p1 = 0;
                buf_size = 1024;
                Timer = system_Tick;
                for (;;)
                {
                    res = f_read(&file1, Buff, buf_size, &s1);
                    p1 += s1;
                    if (res || s1 == 0) break;   /* error or eof */
                }
                Timer2 = system_Tick;
                p3 = Timer;
                printf("%lu bytes read with %d KB/s by buffer size %d KB.\n",
                       p1, p1 / (Timer2 - p3) / 10, buf_size/1024);
                f_close(&file1);

                // test for different buffer size from 10KB
                for (buf_size=10240; buf_size <= sizeof(Buff); buf_size += (1024*10))
                {
                    res = f_open(&file1, ptr, FA_OPEN_EXISTING | FA_READ);
                    p1 = 0;
                    Timer = system_Tick;
                    for (;;)
                    {
                        res = f_read(&file1, Buff, buf_size, &s1);
                        p1 += s1;
                        if (res || s1 == 0) break;   /* error or eof */
                    }
                    Timer2 = system_Tick;
                    p3 = Timer;
                    printf("%lu bytes read with %d KB/s by buffer size %d KB.\n",
                           p1, p1 / (Timer2 - p3) / 10, buf_size/1024);
                    f_close(&file1);
                }
                break;

            case 'w' : /* pw <file_name> - get performance for file writing */
                while (*ptr == ' ') ptr++;
                printf("Opening \"%s\"", ptr);
                res = f_open(&file1, ptr, FA_OPEN_ALWAYS | FA_WRITE);
                putchar('\n');
                if (res)
                {
                    put_rc(res);
                    break;
                }
                printf("Writing...\n");

                // test for 1KB buffer size
                p1 = 0;
                buf_size = 1024;
                Timer = system_Tick;
                for (;;)
                {
                    res = f_write(&file1, Buff, buf_size, &s1);
                    p1 += s1;
                    if (res || p1 >= 4194304) break;   /* error or file size >= 4MB */
                }
                Timer2 = system_Tick;
                p3 = Timer;
                printf("%lu bytes write with %d KB/s by buffer size %d KB.\n",
                       p1, p1 / (Timer2 - p3) / 10, buf_size/1024);
                f_close(&file1);

                // test for different buffer size from 10KB
                for (buf_size=10240; buf_size <= sizeof(Buff); buf_size += (1024*10))
                {
                    p1 = 0;
                    res = f_open(&file1, ptr, FA_OPEN_ALWAYS | FA_WRITE);
                    Timer = system_Tick;
                    for (;;)
                    {
                        res = f_write(&file1, Buff, buf_size, &s1);
                        p1 += s1;
                        if (res || p1 >= 4194304) break;   /* error or file size >= 4MB */
                    }
                    //f_close(&file1);
                    Timer2 = system_Tick;
                    p3 = Timer;
                    printf("%lu bytes write with %d KB/s by buffer size %d KB.\n",
                           p1, p1 / (Timer2 - p3) / 10, buf_size/1024);
                    f_close(&file1);
                }
                break;
            }
            break;

        case '?':       /* Show usage */
            printf(
                _T("dd [<lba>] - Dump sector\n")
                _T("di - Initialize disk\n")
                //_T("ds <pd#> - Show disk status\n")
                _T("\n")
                _T("bd <ofs> - Dump working buffer\n")
                _T("be <ofs> [<data>] ... - Edit working buffer\n")
                _T("br <pd#> <sect> [<num>] - Read disk into working buffer\n")
                _T("bw <pd#> <sect> [<num>] - Write working buffer into disk\n")
                _T("bf <val> - Fill working buffer\n")
                _T("\n")
                _T("fi - Force initialized the logical drive\n")
                _T("fs - Show volume status\n")
                _T("fl [<path>] - Show a directory\n")
                _T("fo <mode> <file> - Open a file\n")
                _T("   <mode> 0x01: read; 0x02: write; 0x04: create\n")
                _T("fc - Close the file\n")
                _T("fe <ofs> - Move fp in normal seek\n")
                //_T("fE <ofs> - Move fp in fast seek or Create link table\n")
                _T("fd <len> - Read and dump the file\n")
                _T("fr <len> - Read the file\n")
                _T("fw <len> <val> - Write ASCII code (<val> = dec or hex) to the file\n")
                _T("fn <object name> <new name> - Rename an object\n")
                _T("fu <object name> - Unlink an object\n")
                _T("fv - Truncate the file at current fp\n")
                _T("fk <dir name> - Create a directory\n")
                _T("fa <attr> <mask> <object name> - Change object attribute\n")
                _T("ft <year> <month> <day> <hour> <min> <sec> <object name> - Change timestamp of an object\n")
                _T("fx <src file> <dst file> - Copy a file\n")
#if _FS_RPATH
                _T("fg <path> - Change current directory\n")
                _T("fj <ld#> - Change current drive\n")
#endif
#if _USE_MKFS
                _T("fm <ld#> <rule> <cluster size> - Create file system\n")
#endif

                _T("pr <src file> - Performance test for Read file\n")
                _T("pw <dst file> - Performance test for Write file\n")

                _T("\n")
            );
            break;
        }
    }
}



/*** (C) COPYRIGHT 2013 Nuvoton Technology Corp. ***/
